{
    "grape___Grape___Black_rot": {
      "name": "Grape Black Rot",
      "symptoms": "Small, brown spots on leaves that expand and develop black margins. Infected grapes shrivel and turn into hard, black 'mummies'.",
      "causes": "Caused by the fungus Guignardia bidwellii. Wet, warm conditions promote infection.",
      "disease_cycle": "Overwinters in mummified fruits and old canes. Rain splashes spread spores to new shoots and fruits during spring and summer.",
      "care_treatment": "Prune and destroy infected material. Apply early-season fungicide sprays. Promote air circulation by proper vine spacing.",
      "wiki_url": "https://en.wikipedia.org/wiki/Black_rot_(grape_disease)"
    },
    "grape___Grape___Esca_(Black_Measles)": {
      "name": "Grape Esca (Black Measles)",
      "symptoms": "Interveinal yellowing and scorching of leaves. Berries show dark spots, shrivel, and dry on the vine.",
      "causes": "Caused by a complex of fungi including Phaeomoniella chlamydospora. Wounds from pruning can facilitate infection.",
      "disease_cycle": "Fungi infect through pruning wounds and colonize the vascular system. Symptoms worsen over several seasons.",
      "care_treatment": "Avoid large pruning wounds. Remove infected vines if severe. Some systemic fungicides may help but control is difficult.",
      "wiki_url": "https://en.wikipedia.org/wiki/Esca_(grape)"
    },
    "grape___Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": {
      "name": "Grape Leaf Blight (Isariopsis Leaf Spot)",
      "symptoms": "Brown, angular lesions on grape leaves, often leading to early defoliation.",
      "causes": "Caused by the fungus Pseudocercospora vitis (formerly Isariopsis). Moist, humid environments encourage disease spread.",
      "disease_cycle": "Spores are produced on infected leaves and spread by wind and rain. New infections occur throughout the growing season.",
      "care_treatment": "Apply protective fungicides during humid periods. Remove fallen infected leaves to reduce inoculum.",
      "wiki_url": "https://www.sciencedirect.com/science/article/abs/pii/S0261219414001135"
    },
    "potato___Potato___Early_blight": {
      "name": "Potato Early Blight",
      "symptoms": "Small brown lesions with concentric rings on leaves. Older leaves yellow and drop prematurely.",
      "causes": "Caused by the fungus Alternaria solani. Stress factors like drought or poor nutrition can worsen outbreaks.",
      "disease_cycle": "Overwinters in soil or debris. Spores are dispersed by wind and rain to infect new plants.",
      "care_treatment": "Use resistant varieties. Apply fungicides early. Maintain proper plant nutrition and avoid water stress.",
      "wiki_url": "https://en.wikipedia.org/wiki/Early_blight"
    },
    "potato___Potato___Late_blight": {
      "name": "Potato Late Blight",
      "symptoms": "Large, irregularly shaped water-soaked lesions on leaves, stems, and tubers; white mold under humid conditions.",
      "causes": "Caused by the oomycete Phytophthora infestans, favored by cool and wet weather.",
      "disease_cycle": "Spores spread rapidly through rain and wind, causing epidemics in wet conditions.",
      "care_treatment": "Destroy infected plants. Apply protective fungicides before expected rain. Plant certified disease-free seed potatoes.",
      "wiki_url": "https://en.wikipedia.org/wiki/Late_blight"
    },
    "potato___Potato___healthy": {
      "name": "Healthy Potato Leaf",
      "symptoms": "No visible signs of disease. Leaves are green, firm, and uniform.",
      "causes": "N/A",
      "disease_cycle": "N/A",
      "care_treatment": "Maintain good crop hygiene, regular monitoring, and optimal nutrition.",
      "wiki_url": ""
    },
    "tomato___Tomato___Bacterial_spot": {
      "name": "Tomato Bacterial Spot",
      "symptoms": "Small, dark brown water-soaked spots on leaves, stems, and fruit. Can cause fruit blemishes and leaf loss.",
      "causes": "Caused by Xanthomonas species. Spread favored by warm, wet weather.",
      "disease_cycle": "Bacteria overwinter in plant debris and seeds. Splashing water spreads bacteria to healthy tissues.",
      "care_treatment": "Use certified disease-free seed. Apply copper-based bactericides. Practice crop rotation.",
      "wiki_url": "https://en.wikipedia.org/wiki/Bacterial_spot"
    },
    "tomato___Tomato___Early_blight": {
      "name": "Tomato Early Blight",
      "symptoms": "Brown circular lesions with concentric rings on lower leaves. Defoliation and poor fruit development follow.",
      "causes": "Caused by the fungus Alternaria solani. Humid conditions favor spread.",
      "disease_cycle": "Spores overwinter in debris and infect plants in moist conditions, spreading via wind and rain.",
      "care_treatment": "Apply fungicides preventively. Maintain plant vigor and spacing. Remove plant debris.",
      "wiki_url": "https://en.wikipedia.org/wiki/Early_blight"
    },
    "tomato___Tomato___Late_blight": {
      "name": "Tomato Late Blight",
      "symptoms": "Dark, greasy lesions on leaves and stems. Fruit may show brown rot with a white mold under humid conditions.",
      "causes": "Caused by Phytophthora infestans. Cool, wet weather accelerates outbreaks.",
      "disease_cycle": "Rapid spread by airborne spores under moist conditions.",
      "care_treatment": "Remove infected plants immediately. Use fungicide sprays during cool, rainy periods.",
      "wiki_url": "https://en.wikipedia.org/wiki/Late_blight"
    },
    "tomato___Tomato___Leaf_Mold": {
      "name": "Tomato Leaf Mold",
      "symptoms": "Yellow spots on upper leaf surfaces, olive-green mold underneath. Severe cases cause leaf drop.",
      "causes": "Caused by the fungus Passalora fulva. High humidity inside greenhouses favors the disease.",
      "disease_cycle": "Spores spread through air and water. Survives in greenhouse debris.",
      "care_treatment": "Increase air circulation. Use resistant varieties. Apply fungicides in greenhouse crops.",
      "wiki_url": "https://en.wikipedia.org/wiki/Leaf_mold"
    },
    "tomato___Tomato___Septoria_leaf_spot": {
      "name": "Tomato Septoria Leaf Spot",
      "symptoms": "Numerous small, dark spots with gray centers on leaves. Causes early defoliation and yield loss.",
      "causes": "Caused by the fungus Septoria lycopersici. Moist, humid conditions favor outbreaks.",
      "disease_cycle": "Spores are produced on infected tissue and spread by water splash.",
      "care_treatment": "Rotate crops. Remove and destroy infected material. Apply appropriate fungicides.",
      "wiki_url": "https://en.wikipedia.org/wiki/Septoria_leaf_spot"
    },
    "tomato___Tomato___Spider_mites Two-spotted_spider_mite": {
      "name": "Tomato Spider Mites (Two-Spotted)",
      "symptoms": "Fine stippling on leaves, yellowing, bronzing, and webbing in severe cases.",
      "causes": "Caused by the tiny pest Tetranychus urticae (two-spotted spider mite). Hot, dry conditions encourage outbreaks.",
      "disease_cycle": "Eggs laid on undersides of leaves hatch and develop rapidly under warm temperatures.",
      "care_treatment": "Spray with miticides or insecticidal soap. Increase humidity. Use predatory mites for biological control.",
      "wiki_url": "https://en.wikipedia.org/wiki/Tetranychus_urticae"
    },
    "tomato___Tomato___Target_Spot": {
      "name": "Tomato Target Spot",
      "symptoms": "Brown lesions with concentric rings resembling a target. Affects leaves, stems, and fruit.",
      "causes": "Caused by the fungus Corynespora cassiicola.",
      "disease_cycle": "Spores spread by wind and water, especially under humid conditions.",
      "care_treatment": "Apply fungicides preventively. Maintain good field sanitation.",
      "wiki_url": "https://www.apsnet.org/edcenter/disandpath/fungalbasidio/pdlessons/Pages/TargetSpot.aspx"
    },
    "tomato___Tomato___Tomato_Yellow_Leaf_Curl_Virus": {
      "name": "Tomato Yellow Leaf Curl Virus",
      "symptoms": "Severe leaf curling, yellowing, and stunted plant growth. Reduces fruit set and quality.",
      "causes": "Caused by Tomato yellow leaf curl virus (TYLCV), transmitted by whiteflies.",
      "disease_cycle": "Whiteflies acquire and transmit the virus while feeding.",
      "care_treatment": "Use resistant varieties. Control whiteflies with insecticides and barriers.",
      "wiki_url": "https://en.wikipedia.org/wiki/Tomato_yellow_leaf_curl_virus"
    },
    "tomato___Tomato___Tomato_mosaic_virus": {
      "name": "Tomato Mosaic Virus",
      "symptoms": "Mottled light and dark green areas on leaves, leaf curling, and reduced fruit yield.",
      "causes": "Caused by Tomato mosaic virus (ToMV), a highly stable virus spread by mechanical contact.",
      "disease_cycle": "Spread by contaminated tools, hands, and infected seeds.",
      "care_treatment": "Disinfect tools. Use virus-free seed. Remove infected plants immediately.",
      "wiki_url": "https://en.wikipedia.org/wiki/Tomato_mosaic_virus"
    },
    "tomato___Tomato___healthy": {
      "name": "Healthy Tomato Leaf",
      "symptoms": "✅ No disease detected. Leaves appear green, strong, and vigorous.",
      "causes": "N/A",
      "disease_cycle": "N/A",
      "care_treatment": "Maintain proper crop care and hygiene practices.",
      "wiki_url": ""
    }
  }